Documents/ПоручениеНаПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаПереводДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрокерПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрочныйПереводБЭСП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучательСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоручениеНаПереводДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.Отправитель = 2 Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.Получатель = 2 Тогда
		ПроверяемыеРеквизиты.Добавить("БрокерПолучатель");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;

	Если ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчетПолучатель");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("БанковкиеВыписки.Обновить");
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	// проверим актуальность р/счета
	ИмяРегистраИсполнителей = Неопределено;
	
	Если ЭтаФорма.Отправитель = 1 Тогда
		ИмяРегистраИсполнителей = "ИсполнителиПоДенежнымСредствамСобственные";
	ИначеЕсли ЭтаФорма.Отправитель = 2 Тогда 
		ИмяРегистраИсполнителей = "ИсполнителиПоДенежнымСредствамБрокерские";
	Иначе
		Объект.РасчетныйСчет = Неопределено;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяРегистраИсполнителей) Тогда
		
		РеквизитыИсполнителя = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет"); 
		
		Если Не РаботаСИсполнителями.ЕстьИсполнитель(ИмяРегистраИсполнителей, РеквизитыИсполнителя) Тогда
			Объект.РасчетныйСчет = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяРегистраИсполнителейПолучатель = Неопределено;
	
	Если ЭтаФорма.Получатель = 1 Тогда
		ИмяРегистраИсполнителей = "ИсполнителиПоДенежнымСредствамСобственные";
	ИначеЕсли ЭтаФорма.Получатель = 2 Тогда 
		ИмяРегистраИсполнителей = "ИсполнителиПоДенежнымСредствамБрокерские";
	Иначе
		Объект.РасчетныйСчетПолучатель = Неопределено;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяРегистраИсполнителейПолучатель) Тогда
		
		РеквизитыИсполнителя = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления"); 
		
		РеквизитыИсполнителя.Вставить("Брокер", Объект.БрокерПолучатель);
		РеквизитыИсполнителя.Вставить("РасчетныйСчет", Объект.РасчетныйСчетПолучатель);
		
		Если Не РаботаСИсполнителями.ЕстьИсполнитель(ИмяРегистраИсполнителейПолучатель, РеквизитыИсполнителя) Тогда
			Объект.РасчетныйСчетПолучатель = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов("Дата");
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
		
	ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов("Брокер");
	
	Объект.РасчетныйСчет = Неопределено;
	
	Если Не ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель Тогда
		Объект.РасчетныйСчетПолучатель = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.БрокерПолучатель) И Не ЗначениеЗаполнено(Объект.Брокер) И Объект.МестоХраненияПолучательСтрокой <> "Внебиржевые_Основной"
		И НеобходимКонтрольПереводов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.БрокерПолучатель) Тогда
	
		Объект.МестоХраненияПолучатель = Неопределено;
		Объект.МестоХраненияПолучательСтрокой = "";
					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Брокер) Тогда
		
		Если Объект.Брокер <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
			Объект.МестоХраненияСтрокой = "Биржевые_ФондоваяТПлюс";	
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Объект.БрокерПолучатель) И Объект.Брокер <> Объект.БрокерПолучатель Тогда
			Объект.БрокерПолучатель = Объект.Брокер; 
		КонецЕсли;
		
		БрокерПолучательПриИзменении(Неопределено);

	КонецЕсли;
		
	ОпределитьЭлементСправочникаМестаХранения();

	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПолучательПриИзменении(Элемент)
	
	Если ЭтаФорма.Получатель <> 2 Тогда
		Объект.БрокерПолучатель               = Неопределено;
		Объект.МестоХраненияПолучательСтрокой = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.БрокерПолучатель) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Брокер) И Объект.МестоХраненияПолучательСтрокой <> "Внебиржевые_Основной"
			И НеобходимКонтрольПереводов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.БрокерПолучатель) Тогда
	
			Объект.МестоХраненияПолучатель = Неопределено;
			Объект.МестоХраненияПолучательСтрокой = "";
			
		КонецЕсли;
		
		Если Объект.БрокерПолучатель <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
			Объект.МестоХраненияПолучательСтрокой = "Биржевые_ФондоваяТПлюс";	
		КонецЕсли; 
					
	КонецЕсли;
	
	ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов("БрокерПолучатель");
	Объект.РасчетныйСчетПолучатель = Неопределено;
	
	ОпределитьЭлементСправочникаМестаХранения("Получатель");
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		
		Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ВалютаРасчетногоСчета Тогда
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта " + Объект.Валюта + " на " + ВалютаРасчетногоСчета + " из расчетного счета.");
							
		КонецЕсли;
			
		Объект.Валюта = ВалютаРасчетногоСчета;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПолучательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
		ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");
		
		Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
			
			ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
			
			Если ВалютаРасчетногоСчетаПолучателя <> ВалютаРасчетногоСчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта " + ВалютаРасчетногоСчетаПолучателя + " расчетного счета " + Объект.РасчетныйСчетПолучатель + " отличается от валюты " + ВалютаРасчетногоСчета + " расчетного счета ОТКУДА.",,, "Объект.РасчетныйСчетПолучатель");
				Объект.РасчетныйСчетПолучатель = Неопределено;
			КонецЕсли;
			
		Иначе
				
			Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ВалютаРасчетногоСчетаПолучателя Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта " + Объект.Валюта + " на " + ВалютаРасчетногоСчетаПолучателя + " из расчетного счета.");
							
			КонецЕсли;
			
			Объект.Валюта = ВалютаРасчетногоСчетаПолучателя;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Если Объект.Брокер <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
		Объект.МестоХраненияСтрокой = "Биржевые_ФондоваяТПлюс";
	Иначе
		Объект.МестоХраненияСтрокой = "";	
	КонецЕсли;

	Если Объект.БрокерПолучатель <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
		Объект.МестоХраненияПолучательСтрокой = "Биржевые_ФондоваяТПлюс";
	Иначе
		Объект.МестоХраненияПолучательСтрокой = "";	
	КонецЕсли; 	
	
	ОпределитьЭлементСправочникаМестаХранения();
	ОпределитьЭлементСправочникаМестаХранения("Получатель");
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	
	ОпределитьЭлементСправочникаМестаХранения();
	
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И ЗначениеЗаполнено(Объект.Брокер) И НеобходимКонтрольПереводов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Брокер)
		И ЗначениеЗаполнено(Объект.МестоХранения) И Объект.МестоХраненияСтрокой <> "Внебиржевые_Основной" Тогда
		
		ЭтаФорма.Получатель = 2;
		Объект.БрокерПолучатель = Объект.Брокер;
		
		Объект.РасчетныйСчетПолучатель = Неопределено;
			
	КонецЕсли;
	
	Если Элемент <> Неопределено Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПолучательПриИзменении(Элемент)
	
	ОпределитьЭлементСправочникаМестаХранения("Получатель");
		
	Если Элемент <> Неопределено Тогда
		НастроитьВидимостьИДоступность(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	ВыборИсполнителя(Команда.Имя);
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) И ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");
		
		Если ВалютаРасчетногоСчета <> ВалютаРасчетногоСчетаПолучателя Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет КУДА был очищен, т.к. валюта " + ВалютаРасчетногоСчетаПолучателя + " отличается от валюты " + ВалютаРасчетногоСчета + " расчетного счета ОТКУДА.",,, "Объект.РасчетныйСчетПолучатель");
			Объект.РасчетныйСчетПолучатель = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РасчетныйСчетПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель(Команда)
	
	ВыборИсполнителя(Команда.Имя);
	РасчетныйСчетПолучательПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте 
Процедура ВыборИсполнителя(ИмяКоманды)
	
	Если ИмяКоманды = "КомандаВыбратьИсполнителяПоДенежнымСредствам" Тогда
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, (ЭтаФорма.Отправитель = 2));
	ИначеЕсли ИмяКоманды = "КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель" Тогда		
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, (ЭтаФорма.Получатель = 2),
		Новый Структура("Брокер, РасчетныйСчет, СчетДоверительногоУправления", "БрокерПолучатель", "РасчетныйСчетПолучатель", "СчетДоверительногоУправления"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма) 
	
	Элементы      = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	Если ЗначениеЗаполнено(ДанныеОбъекта.БрокерПолучатель) И Не ЗначениеЗаполнено(ДанныеОбъекта.Брокер) И Не Форма.ДетализацияПоРасчетномуСчетуПолучатель Тогда
		Форма.ДетализацияПоРасчетномуСчетуПолучатель = Истина;
	КонецЕсли;
	
	ДетализацияПоРасчетномуСчету		   = Форма.ДетализацияПоРасчетномуСчету;
	ДетализацияПоРасчетномуСчетуПолучатель = Форма.ДетализацияПоРасчетномуСчетуПолучатель;
		
	// элементы, зависящие от детализации по р/с
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствам.Видимость = ДетализацияПоРасчетномуСчету И Форма.Отправитель <> 3;
	Элементы.РасчетныйСчет.Видимость                                = ДетализацияПоРасчетномуСчету Или Форма.Отправитель = 3;
	
	Элементы.РасчетныйСчет.ОтметкаНезаполненного = Ложь;	
	Элементы.РасчетныйСчет.АвтоОтметкаНезаполненного = (Форма.Отправитель <> 3);	
	
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель.Видимость = ДетализацияПоРасчетномуСчетуПолучатель И Форма.Получатель <> 3;
	Элементы.РасчетныйСчетПолучатель.Видимость                                = ДетализацияПоРасчетномуСчетуПолучатель Или Форма.Получатель = 3;
	
	Элементы.РасчетныйСчетПолучатель.ОтметкаНезаполненного = Ложь;	
	Элементы.РасчетныйСчетПолучатель.АвтоОтметкаНезаполненного = (Форма.Получатель <> 3);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьСтатуса(Форма);
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Не ПустаяСтрока(Форма.Статус) Тогда
		
		Если Форма.Статус = "АКТИВНО" Тогда
			ЦветДекорации = Новый Цвет(50, 100, 255); //Синий
		ИначеЕсли Форма.Статус = "ИСПОЛНЕНО" Тогда
			ЦветДекорации = Новый Цвет(50, 150, 100); //Салатовый
		ИначеЕсли Форма.Статус = "ЗАПРОС НА ОТМЕНУ" Тогда
			ЦветДекорации = Новый Цвет(150, 150, 150); //Серый
		ИначеЕсли Форма.Статус = "СНЯТО" Тогда
			ЦветДекорации = Новый Цвет(0, 0, 0); //Черный
		ИначеЕсли Форма.Статус = "ОТПРАВЛЕНО" Тогда
			ЦветДекорации = Новый Цвет(150, 200, 0); 
		ИначеЕсли Форма.Статус = "ОШИБКА ПРИ ЭКСПОРТЕ" Тогда
			ЦветДекорации = Новый Цвет(255, 0, 0); //Красный
		Иначе
			Возврат;
		КонецЕсли;
		
		Элементы.ДекорацияСтатус.Ширина     = СтрДлина(Форма.Статус) + 3;
		Элементы.ДекорацияСтатус.Заголовок  = Форма.Статус;
		Элементы.ДекорацияСтатус.ЦветРамки  = ЦветДекорации;
		Элементы.ДекорацияСтатус.ЦветТекста = ЦветДекорации;
		Элементы.ДекорацияСтатус.Видимость  = Истина;
	Иначе
		Элементы.ДекорацияСтатус.Заголовок = "";
		Элементы.ДекорацияСтатус.Видимость  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	БрокерБК = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;

	Элементы.Брокер.Видимость 	      	                = (Форма.Отправитель = 2);
	Элементы.ЗаполнитьСуммуИзОстаткаНаБрокере.Видимость = (Форма.Отправитель = 2);
	Элементы.МестоХраненияСтрокой.Видимость             = (Форма.Отправитель = 2) И ЗначениеЗаполнено(Объект.Брокер);
	Элементы.БрокерПолучатель.Видимость                 = (Форма.Получатель = 2);
	Элементы.МестоХраненияПолучательСтрокой.Видимость   = (Форма.Получатель = 2) И ЗначениеЗаполнено(Объект.БрокерПолучатель);
	Элементы.ДекорацияАкцептовано.Видимость             = (ЗначениеЗаполнено(Объект.Ссылка) И РаботаСДокументами.ДокументАкцептован(Объект.Ссылка, Объект.Организация));
	
	Элементы.МестоХраненияСтрокой.Доступность           = (Форма.Отправитель = 2) И ЗначениеЗаполнено(Объект.Брокер) И Объект.Брокер = БрокерБК;
	Элементы.МестоХраненияПолучательСтрокой.Доступность = (Форма.Получатель = 2) И ЗначениеЗаполнено(Объект.БрокерПолучатель) И Объект.БрокерПолучатель = БрокерБК;
	
	Если ЗначениеЗаполнено(Объект.Брокер) И (Объект.Брокер <> БрокерБК ИЛИ ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И НеобходимКонтрольПереводов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Брокер)
		И ЗначениеЗаполнено(Объект.МестоХранения) И ЗначениеЗаполнено(Объект.МестоХраненияСтрокой) И Объект.МестоХраненияСтрокой <> "Внебиржевые_Основной") Тогда
		Элементы.ГруппаБрокерПолучатель.Доступность = Ложь;
	Иначе
		Элементы.ГруппаБрокерПолучатель.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ГруппаБрокер.Доступность = Не (ЗначениеЗаполнено(Объект.БрокерПолучатель) И Объект.БрокерПолучатель <> БрокерБК);
		
	// элементы, зависящие от детализации по р/с
	НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
		
	//Статус
	НастроитьВидимостьСтатуса(Форма);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруОтбора(Организация, РасчетныйСчет, РасчетныйСчетПолучатель, ВидДвижения)

	Результат = Новый Структура;
	
	ЮрФизЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо");
	
	Если ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
		
		ЮрФизЛицоРасчетногоСчетаПолучателя	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчетПолучатель, "ЮрФизЛицо");
		ЮрФизЛицоБанкаПолучателя			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РасчетныйСчетПолучатель, Новый Структура("ЮрЛицо", "Банк.ЮрФизЛицо")).ЮрЛицо;			
		
		Контрагент = ?(ЮрФизЛицоОрганизации = ЮрФизЛицоРасчетногоСчетаПолучателя, ЮрФизЛицоРасчетногоСчетаПолучателя, ЮрФизЛицоБанкаПолучателя);  
	
		Результат.Вставить("ВидДвижения", Перечисления.ВидыДвижений.Расход);
		Результат.Вставить("Контрагент", Контрагент);
		Результат.Вставить("РасчетныйСчет", РасчетныйСчет);
		Результат.Вставить("РасчетныйСчетПолучатель", РасчетныйСчетПолучатель);
		
	Иначе
		
		ЮрФизЛицоРасчетногоСчета			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчет, "ЮрФизЛицо");
		ЮрФизЛицоБанка						= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РасчетныйСчет, Новый Структура("ЮрЛицо", "Банк.ЮрФизЛицо")).ЮрЛицо;	
		
		Контрагент = ?(ЮрФизЛицоОрганизации = ЮрФизЛицоРасчетногоСчета, ЮрФизЛицоРасчетногоСчета, ЮрФизЛицоБанка);  
		
		Результат.Вставить("ВидДвижения", Перечисления.ВидыДвижений.Приход);
		Результат.Вставить("Контрагент", Контрагент);
		Результат.Вставить("РасчетныйСчет", РасчетныйСчет);
		Результат.Вставить("РасчетныйСчетПолучатель", РасчетныйСчетПолучатель);
	
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатус(Ссылка)

	// На основании поручении не всегда создаем перевод ДС. В таких случаях статуса "Исполнено" на стороне QUIKа нам достаточно.
	// 1. Биржа. Не создаем переводы когда: [Т+ раздел REPO] --> [Т+ основной раздел] и наоборот.    
	// 2. Внебиржа. Создаем переводы только когда перевод осуществляется на валютный или с валютного раздела [Внебиржевые_Валютный_V] 
	
	ТекущийСтатус = РаботаСДокументами.ПолучитьТекущийСтатусПорученияНаПереводДенежныхСредств(Ссылка);
		
	Возврат ?(ЗначениеЗаполнено(ТекущийСтатус), ВРег(Строка(ТекущийСтатус)), "");
		
КонецФункции 

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	ЭтаФорма.ДетализацияПоРасчетномуСчету 			= РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект, "БрокерПолучатель");
	
	Если Объект.МестоХранения = ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК") Тогда
		ЭтаФорма.Отправитель = 3;
	ИначеЕсли ЗначениеЗаполнено(Объект.Брокер) Тогда
		ЭтаФорма.Отправитель = 2;
	Иначе
		ЭтаФорма.Отправитель = 1;
	КонецЕсли; 
	
	Если Объект.МестоХраненияПолучатель = ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК") Тогда
		ЭтаФорма.Получатель = 3;
	ИначеЕсли ЗначениеЗаполнено(Объект.БрокерПолучатель) Тогда
		ЭтаФорма.Получатель = 2;
	Иначе
		ЭтаФорма.Получатель = 1;
	КонецЕсли;

	Статус = ПолучитьСтатус(Объект.Ссылка);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
		
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ИмяЭлемента) 
	
	СвязанныеРеквизиты = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, Брокер, БрокерПолучатель");
	
	Если      ИмяЭлемента = "Дата" Или ИмяЭлемента = "Организация" Тогда
		ЭтаФорма.ДетализацияПоРасчетномуСчету 			= РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты);	
		ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты, "БрокерПолучатель");	
	ИначеЕсли ИмяЭлемента = "Брокер" Тогда
		ЭтаФорма.ДетализацияПоРасчетномуСчету 			= РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты);	
		ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты, "БрокерПолучатель");
	ИначеЕсли ИмяЭлемента = "БрокерПолучатель" Тогда
		ЭтаФорма.ДетализацияПоРасчетномуСчетуПолучатель = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(СвязанныеРеквизиты, "БрокерПолучатель");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте
Процедура ОпределитьЭлементСправочникаМестаХранения(Получатель = "")
		
	ИмяРеквизита        = "МестоХранения" + Получатель;
	ИмяРеквизитаСтрокой = ИмяРеквизита + "Строкой";
	
	Если ЭтаФорма[?(ЗначениеЗаполнено(Получатель), Получатель, "Отправитель")] = 3 Тогда
		
		ЭтаФорма.Объект[ИмяРеквизитаСтрокой] = "";
		Объект[ИмяРеквизита] = ПредопределенноеЗначение("Справочник.МестаХранения.ММВБ_ДепозитыСЦК");
        Возврат;
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект["Брокер" + Получатель]) Тогда
		
		ЭтаФорма.Объект[ИмяРеквизитаСтрокой] = "";
		Объект[ИмяРеквизита] = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");
		Возврат;
		
	КонецЕсли;
	
	ЗначениеРеквизитаСтрокой = ЭтаФорма.Объект[ИмяРеквизитаСтрокой];
	
	Если СтрНайти(ЗначениеРеквизитаСтрокой, "Внебиржевые_") > 0 Тогда
		Объект[ИмяРеквизита] = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");
	ИначеЕсли ЗначениеРеквизитаСтрокой = "Биржевые_ФондоваяТПлюс" Тогда
		
		Если Объект["Брокер" + Получатель] = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
			Объект[ИмяРеквизита] = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ_Торговый+");
		Иначе
			Объект[ИмяРеквизита] = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС");	
		КонецЕсли;
		
	ИначеЕсли ЗначениеРеквизитаСтрокой = "Биржевые_Валютная" Тогда
		Объект[ИмяРеквизита] = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FX");
	ИначеЕсли ЗначениеРеквизитаСтрокой = "Биржевые_FORTS" Тогда	
		Объект[ИмяРеквизита] = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FORTS");		
	ИначеЕсли ЗначениеРеквизитаСтрокой = "Биржевые_РЕПО" Тогда	
		Объект[ИмяРеквизита] = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ_Торговый+");			
	Иначе
		// Все остальное по умолчанию относим к внебиржевому рынку
		Объект[ИмяРеквизита] = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок");		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеобходимКонтрольПереводов(Дата, Организация, СчетДУ, Брокер)
		
	Если Не (РаботаСДокументами.НеобходимКонтрольПереводовБрокера(Брокер) И РаботаСДокументами.ДействуетКонтрольПрямыхПереводНаСчетаБиржи(СчетДУ)) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК Договор
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Дата,
		|			Брокер = &Брокер
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	НЕ КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания ЕСТЬ NULL
		|	И КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения < &Дата
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &Дата)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Если Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета доверительного управления [" + СчетДУ + "] не найден договор с брокером [" + Брокер + "]! Проверьте действие договора на дату текущего документа [" + Дата + "].");	
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСуммуИзОстаткаНаБрокереНаСервере(Фильтр)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ОстаткиДенежныхСредствОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0) + ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток, 0) КАК СуммаЗадолженности
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Брокер = &Брокер
		|				И Валюта = &Валюта
		|				И МестоХранения = &МестоХранения) КАК ОстаткиДенежныхСредствОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Основание.Брокер = &Брокер
		|					И Валюта = &Валюта
		|					И (Основание.МестоХранения = &МестоХранения
		|						ИЛИ Основание.МестоХранения ЕСТЬ NULL)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ПО ОстаткиДенежныхСредствОстатки.Организация = ЗадолженностиПоДенежнымСредствамОстатки.Организация
		|			И ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления = ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Организация", Фильтр.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Фильтр.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер", Фильтр.Брокер);
	Запрос.УстановитьПараметр("Валюта", Фильтр.Валюта);
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Фильтр.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МестоХранения", Фильтр.МестоХранения);              
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Если ТЗ[0].СуммаЗадолженности > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента на регистре ""Задолженности по денежным средствам"" сумма остатка " + ТЗ[0].СуммаЗадолженности);
		Возврат 0;
	КонецЕсли;
	Если ТЗ[0].СуммаОстаток > 0 Тогда
		Возврат ТЗ[0].СуммаОстаток;
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСуммуИзОстаткаНаБрокере(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Или Не ЗначениеЗаполнено(Объект.МестоХранения) Или Не ЗначениеЗаполнено(Объект.Брокер) Или Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для заполнения поля ""Сумма"" необходимо заполнить поле ""Счет д/у"", ""Брокер"", ""Валюта"", ""Место хранения""");
		Возврат;
	КонецЕсли;
	Фильтр = Новый Структура("Дата, Организация, Брокер, СчетДоверительногоУправления, МестоХранения, Валюта", 
							Объект.Дата, Объект.Организация, Объект.Брокер, Объект.СчетДоверительногоУправления, Объект.МестоХранения, Объект.Валюта);
	Объект.Сумма = ПолучитьСуммуИзОстаткаНаБрокереНаСервере(Фильтр);
	
КонецПроцедуры 

&НаКлиенте
Процедура МестоХраненияПолучательСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И НеобходимКонтрольПереводов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.БрокерПолучатель) И Не ЗначениеЗаполнено(Объект.Брокер) Тогда
		
		СтандартнаяОбработка = Ложь;		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить("Внебиржевые_Основной", "Внебиржевые: Основной");
						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Брокер) И Объект.Брокер <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
		//Если брокер не БК Регион - дс поступают/списываются с ММВБ
		СтандартнаяОбработка = Ложь;		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить("Биржевые_ФондоваяТПлюс", "Биржевые: Фондовая Т+");
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Брокер) И ВыбранноеЗначение <> Объект.Брокер Тогда
			
		Если Вопрос("Выбранное значение брокера получателя [" + ВыбранноеЗначение + "] не соответствует значению брокера отправителя [" + Объект.Брокер + "]. Переводы между брокерами запрещены. Для брокера получателя будет установлено значение [" + Объект.Брокер + "]. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ВыбранноеЗначение = Объект.Брокер;			
		Иначе
			ВыбранноеЗначение = Неопределено;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчет);
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчетПолучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	Если ЭтаФорма.Отправитель = 3 Тогда
		
		СтандартнаяОбработка = Ложь;
		Объект.РасчетныйСчет = ПолучитьСчетНКЦ();
	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВалютаВыбранногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Валюта");
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
		ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");
			
		Если ВалютаРасчетногоСчетаПолучателя <> ВалютаВыбранногоСчета Тогда
			
			Если Вопрос("Валюта " + ВалютаРасчетногоСчетаПолучателя + " расчетного счета КУДА не соответствует валюте " + ВалютаВыбранногоСчета + " расчетного счёта " + ВыбранноеЗначение + ". Расчетный счёт КУДА будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.РасчетныйСчетПолучатель = Неопределено;			
			Иначе
				ВыбранноеЗначение = Объект.РасчетныйСчет;			
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура РасчетныйСчетПолучательНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЭтаФорма.Получатель = 3 Тогда
		
		СтандартнаяОбработка = Ложь;
		Объект.РасчетныйСчетПолучатель = ПолучитьСчетНКЦ();
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	
	Объект.Брокер = Неопределено;
	БрокерПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	Объект.БрокерПолучатель = Неопределено;	     
	БрокерПолучательПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСчетНКЦ()
	
	ПараметрыФормыВыбора = Новый Структура("Организация, ЮрФизЛицо, Валюта, ТолькоСчетаКлиента",
											Объект.Организация, ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"), Объект.Валюта, Ложь);
	
	РезультатВыбора = ОткрытьФормуМодально("Справочник.БанковскиеСчета.Форма.ФормаВыбораСчетаКлиента", ПараметрыФормыВыбора, ЭтаФорма);
	
	Возврат РезультатВыбора;
	
КонецФункции

#КонецОбласти
